const GiftIcon = ({ size = 32, color = "#606e80", className, ...rest }) => (
  <svg
    xmlns="http://www.w3.org/2000/svg"
    width={size}
    height={(size * 28) / 32} // الحفاظ على النسبة الأصلية
    viewBox="0 0 32 28"
    className={className}
    {...rest}
  >
    <path
      d="M2,28.25a2,2,0,0,0,2,2H14v-10H2Zm16,2H28a2,2,0,0,0,2-2v-8H18Zm12-20H27.369A5.45,5.45,0,0,0,28,7.75a5.508,5.508,0,0,0-5.5-5.5c-2.6,0-4.281,1.331-6.437,4.269C13.906,3.581,12.225,2.25,9.625,2.25a5.508,5.508,0,0,0-5.5,5.5,5.373,5.373,0,0,0,.631,2.5H2a2,2,0,0,0-2,2v5a1,1,0,0,0,1,1H31a1,1,0,0,0,1-1v-5A2,2,0,0,0,30,10.25Zm-20.381,0a2.5,2.5,0,0,1,0-5c1.244,0,2.163.206,5.381,5Zm12.881,0H17.119c3.213-4.781,4.106-5,5.381-5a2.5,2.5,0,0,1,0,5Z"
      fill={color}
      transform="translate(0 -2.25)"
    />
  </svg>
);

export default GiftIcon;