const CarSideIcon = ({ size = 32, color = "#606e80", className, ...rest }) => (
  <svg
    xmlns="http://www.w3.org/2000/svg"
    width={size}
    height={(size * 22.4) / 32} // الحفاظ على النسبة الأصلية
    viewBox="0 0 32 22.4"
    className={className}
    {...rest}
  >
    <path
      d="M27.2,10.25h-.8l-5.439-6.8a3.2,3.2,0,0,0-2.5-1.2H7.767A3.2,3.2,0,0,0,4.8,4.262l-2.4,6.1A3.193,3.193,0,0,0,0,13.45v5.6a.8.8,0,0,0,.8.8H3.2a4.8,4.8,0,0,0,9.6,0h6.4a4.8,4.8,0,0,0,9.6,0h2.4a.8.8,0,0,0,.8-.8v-4A4.8,4.8,0,0,0,27.2,10.25ZM8,22.25a2.4,2.4,0,1,1,2.4-2.4A2.4,2.4,0,0,1,8,22.25Zm3.6-12H5.847l1.92-4.8H11.6Zm2.4,0V5.45h4.462l3.84,4.8Zm10,12a2.4,2.4,0,1,1,2.4-2.4A2.4,2.4,0,0,1,24,22.25Z"
      fill={color}
      transform="translate(0 -2.25)"
    />
  </svg>
);

export default CarSideIcon;