const RefreshTwoDirectionsIcon = ({ size = 32, color = "#606e80", className, ...rest }) => (
  <svg
    xmlns="http://www.w3.org/2000/svg"
    width={size}
    height={(size * 26.926) / 32} // يحافظ على نسبة الطول للعرض
    viewBox="0 0 32 26.926"
    className={className}
    {...rest}
  >
    <g id="refresh_icon" data-name="refresh icon" transform="translate(-3 -5.062)">
      <path
        id="Path_4006"
        data-name="Path 4006"
        d="M4.229,21.953a1.226,1.226,0,0,0,.976-.48l.535-.7a13.459,13.459,0,0,0,24.475,5.2,1.231,1.231,0,1,0-2.053-1.36A10.99,10.99,0,0,1,8.141,20.144l1.054.811A1.231,1.231,0,0,0,10.7,19L7.778,16.758c-.612-.471-1.482-.736-2.036-.014L3.256,19.973a1.23,1.23,0,0,0,.974,1.98Zm3.9-9.175a1.233,1.233,0,0,0,1.707-.346A10.99,10.99,0,0,1,29.86,16.906l-1.054-.811a1.231,1.231,0,0,0-1.5,1.951l2.918,2.246c.623.479,1.473.747,2.036.014l2.486-3.228a1.23,1.23,0,1,0-1.95-1.5l-.535.7a13.46,13.46,0,0,0-24.475-5.2,1.233,1.233,0,0,0,.346,1.707Z"
        fill={color}
      />
    </g>
  </svg>
);

export default RefreshTwoDirectionsIcon;